let words = [
    "шоколад",
    "уголь",
    "афроамериканец",
    "мышь",
    "арматура",
    "чернота",
    "наггетсы",
    "рассвет",
    "вода",
    "солнце",
    "апельсин",
    "искусство",
    "пробка",
    "микроб",
    "лепешка",
    "прокрастинация"
];

words.sort(function(a,b) {
    // a > b
    // a < b => элементы меняются местами
    // console.log("a", a);
    // console.log("b", b);
    return Math.random() - 0.5;
});
words.sort(() => Math.random() - 0.5);

// console.log(words);